Pandas

In [1]:
import numpy as np
import pandas as pd

Basics of pandas structure

Series and Dataframe

Series: a one-dimensional labeled array holding data of any type

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Dataframe: a two-dimensional data structure which included rows and column

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.556641  0.741168  0.339205  1.968049
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622
2013-01-03  1.830698  0.479165  0.359505 -1.271278
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883
2013-01-05  0.974934  1.033215  0.096421 -0.871656
2013-01-06 -0.735982  0.149456 -0.100377  0.851096

In [7]:
#passing a dictionary of value where key is for column name and value is for value
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.dtypes #to get all the dtyoes of dataframe``

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

Viewing Data

In [10]:
#Use head and tail to select the top and bottom row
print(df.head(3))
print(df.tail(3))

                   A         B         C         D
2013-01-01  1.556641  0.741168  0.339205  1.968049
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622
2013-01-03  1.830698  0.479165  0.359505 -1.271278
                   A         B         C         D
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883
2013-01-05  0.974934  1.033215  0.096421 -0.871656
2013-01-06 -0.735982  0.149456 -0.100377  0.851096

In [11]:
#Select the index or column
print(df.columns)
print(df.index)

Index(['A', 'B', 'C', 'D'], dtype='object')
DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
#Convert value into numpy arrays
a = df.to_numpy()
a

array([[ 1.5566414 ,  0.74116786,  0.33920525,  1.96804901],
       [-0.31388676, -1.72473966, -0.36219244,  0.39962236],
       [ 1.83069846,  0.47916504,  0.35950465, -1.2712778 ],
       [-0.96567145, -0.14081649, -0.84013937, -1.6968833 ],
       [ 0.97493437,  1.03321549,  0.09642123, -0.87165642],
       [-0.73598159,  0.14945572, -0.10037661,  0.85109568]])

In [ ]:
#show the summary of your dataframe
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.391122  0.089575 -0.084596 -0.103508
std    1.214903  0.981348  0.459947  1.410556
min   -0.965671 -1.724740 -0.840139 -1.696883
25%   -0.630458 -0.068248 -0.296738 -1.171372
50%    0.330524  0.314310 -0.001978 -0.236017
75%    1.411215  0.675667  0.278509  0.738227
max    1.830698  1.033215  0.359505  1.968049

In [14]:
#Transposing data(Column to Index, Index to Column)
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.556641   -0.313887    1.830698   -0.965671    0.974934   -0.735982
B    0.741168   -1.724740    0.479165   -0.140816    1.033215    0.149456
C    0.339205   -0.362192    0.359505   -0.840139    0.096421   -0.100377
D    1.968049    0.399622   -1.271278   -1.696883   -0.871656    0.851096

In [15]:
# Sort index
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.968049  0.339205  0.741168  1.556641
2013-01-02  0.399622 -0.362192 -1.724740 -0.313887
2013-01-03 -1.271278  0.359505  0.479165  1.830698
2013-01-04 -1.696883 -0.840139 -0.140816 -0.965671
2013-01-05 -0.871656  0.096421  1.033215  0.974934
2013-01-06  0.851096 -0.100377  0.149456 -0.735982

In [16]:
# Sort by value
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883
2013-01-06 -0.735982  0.149456 -0.100377  0.851096
2013-01-03  1.830698  0.479165  0.359505 -1.271278
2013-01-01  1.556641  0.741168  0.339205  1.968049
2013-01-05  0.974934  1.033215  0.096421 -0.871656

Getitem

In [17]:
df['A']

2013-01-01    1.556641
2013-01-02   -0.313887
2013-01-03    1.830698
2013-01-04   -0.965671
2013-01-05    0.974934
2013-01-06   -0.735982
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  1.556641  0.741168  0.339205  1.968049
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622
2013-01-03  1.830698  0.479165  0.359505 -1.271278

In [19]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622
2013-01-03  1.830698  0.479165  0.359505 -1.271278
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883

In [ ]:
df.loc[dates[0]]

A    1.556641
B    0.741168
C    0.339205
D    1.968049
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.556641  0.741168
2013-01-02 -0.313887 -1.724740
2013-01-03  1.830698  0.479165
2013-01-04 -0.965671 -0.140816
2013-01-05  0.974934  1.033215
2013-01-06 -0.735982  0.149456

In [23]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.313887 -1.724740
2013-01-03  1.830698  0.479165
2013-01-04 -0.965671 -0.140816

In [24]:
df.loc[dates[0], "A"]

1.5566414015028243

In [ ]:
# Faster to access a single data
df.at[dates[0], "A"]

Select by position

In [25]:
df.iloc[3]

A   -0.965671
B   -0.140816
C   -0.840139
D   -1.696883
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.965671 -0.140816
2013-01-05  0.974934  1.033215

In [27]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.313887 -0.362192
2013-01-03  1.830698  0.359505
2013-01-05  0.974934  0.096421

In [28]:
# For faster access of single data
df.iat[1, 1]

-1.7247396632638046

Boolyn indexing

Select by index

In [29]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.556641  0.741168  0.339205  1.968049
2013-01-03  1.830698  0.479165  0.359505 -1.271278
2013-01-05  0.974934  1.033215  0.096421 -0.871656

In [ ]:
# All values that is bigger than 0 or else Nan
df[df>0]

                   A         B         C         D
2013-01-01  1.556641  0.741168  0.339205  1.968049
2013-01-02       NaN       NaN       NaN  0.399622
2013-01-03  1.830698  0.479165  0.359505       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05  0.974934  1.033215  0.096421       NaN
2013-01-06       NaN  0.149456       NaN  0.851096

In [ ]:
#Use is in method for easier filtering
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
print(df2)
print(df2[df2["E"].isin(['two','four'])])

                   A         B         C         D      E
2013-01-01  1.556641  0.741168  0.339205  1.968049    one
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622    one
2013-01-03  1.830698  0.479165  0.359505 -1.271278    two
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883  three
2013-01-05  0.974934  1.033215  0.096421 -0.871656   four
2013-01-06 -0.735982  0.149456 -0.100377  0.851096  three
                   A         B         C         D     E
2013-01-03  1.830698  0.479165  0.359505 -1.271278   two
2013-01-05  0.974934  1.033215  0.096421 -0.871656  four

Missing Data

In [ ]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"]) # Place NaN value in blank space
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C         D    E
2013-01-01  1.556641  0.741168  0.339205  1.968049  1.0
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622  1.0
2013-01-03  1.830698  0.479165  0.359505 -1.271278  NaN
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883  NaN

In [ ]:
df1.dropna(how='any') #Drop any rows that have missing data

                   A         B         C         D    E
2013-01-01  1.556641  0.741168  0.339205  1.968049  1.0
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622  1.0

In [ ]:
df1.fillna(value=5) #Fill in missing data with a value

                   A         B         C         D    E
2013-01-01  1.556641  0.741168  0.339205  1.968049  1.0
2013-01-02 -0.313887 -1.724740 -0.362192  0.399622  1.0
2013-01-03  1.830698  0.479165  0.359505 -1.271278  5.0
2013-01-04 -0.965671 -0.140816 -0.840139 -1.696883  5.0

In [35]:
pd.isna(df1) #Get boolean mask where values are nan

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True